hazy1k/STM32-Study-Notes/3.开发板必备资料/模块资料/野火【蓝牙_HC05】模块资料/1-配套参考资料和代码/开发板配套例程/F767_挑战者_V2开发板/1.HC05测试程序(不带液晶)/User/hc05/bsp_blt_usart.h
#ifndef  _BSP_BLT_USART_
#define  _BSP_BLT_USART_

#include "stm32f7xx.h"
#include <stdio.h>

//Òý½Å¶¨Òå
/*******************************************************/
#define BLT_USART_BAUD_RATE                       38400




#define BLT_USARTx                            USART6
#define BLT_UARTx_CLK_ENABLE()                __USART6_CLK_ENABLE();

#define BLT_RCC_PERIPHCLK_UARTx               RCC_PERIPHCLK_USART6
#define BLT_RCC_UARTxCLKSOURCE_SYSCLK         RCC_USART6CLKSOURCE_PCLK2

#define BLT_UARTx_RX_GPIO_PORT                GPIOC
#define BLT_UARTx_RX_GPIO_CLK_ENABLE()        __HAL_RCC_GPIOC_CLK_ENABLE()
#define BLT_UARTx_RX_PIN                         GPIO_PIN_7
#define BLT_UARTx_RX_AF                          GPIO_AF8_USART6


#define BLT_UARTx_TX_GPIO_PORT                GPIOC
#define BLT_UARTx_TX_GPIO_CLK_ENABLE()        __HAL_RCC_GPIOC_CLK_ENABLE()
#define BLT_UARTx_TX_PIN                      GPIO_PIN_6
#define BLT_UARTx_TX_AF                       GPIO_AF8_USART6

#define BLT_UARTx_IRQHandler                  USART6_IRQHandler
#define BLT_UARTx_IRQ                 		    USART6_IRQn

/*******************************************************/


void BLT_USART_Config(void);
void BLT_Usart_SendString(uint8_t *str);

void bsp_USART_Process(void);
char *get_rebuff(uint16_t *len);
void clean_rebuff(void);






#endif

